Tekla Open API Reference for Tekla Structures 2025
TeklaProgressBar Events
The TeklaProgressBar type exposes the following members.
Events
Name | Description
CancelClicked
The CancelClicked event is raised when the cancel button is clicked.
Top
See Also
Reference
TeklaProgressBar Class
Tekla.Structures.Dialog Namespace